Revit 2024 API
FabricationDimensionDefinition.Type Property
 Fabrication dimension type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public FabricationDimensionType Type { get; }
Visual Basic
Public ReadOnly Property Type As FabricationDimensionType
	Get
Visual C++
public:
property FabricationDimensionType Type {
	FabricationDimensionType get ();
}
See Also
FabricationDimensionDefinition Class
Autodesk.Revit.DB Namespace